Revit 2026 API

# WireSizeDiameter Property

---

Get diameter of wire.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Diameter { get; }
```
```vb
Public ReadOnly Property Diameter As Double
	Get
```
```cpp
public:
property double Diameter {
	double get ();
}
```
```fsharp
member Diameter : float with get
```

#### Property Value

Double

#### Reference

WireSize Class

Autodesk.Revit.DB.Electrical Namespace